package home_section001_classes;

import java.util.Arrays;
// Задача 103
public class HomeDynaArrayAsString {
    int[] result = new int[5];

    int count;

    /**
     * динамически расширяет динамический массив при увеличение элементов
     * @param value число которое записываем в массив
     */


    /**
     * Получает копию статического исходного массива основываясь на исходном массиве и на кол-ве элементов которыми он заполнен
     * @return будет возвращать статический массив целого типа в количестве count
     */


    /**
     * @return строковое представления массива [....]
     */

}
