package home_section001_classes;

/**
 * Создать класс DynaArray в этом же пакете home_section001_classes, в нем объявить один int[] массив и задать размер 5 и одну переменную int
 * Создать в классе HomeSolutionVer2 объект класса DynaArray и этому объекту присвоить ссылку на метод getPositiveNumbers(array);
 * Создание функции (add) добавления элемента в динамический массив
 * Удалить решение
 */
public class HomeSolutionVer2 {
    public static void main(String[] args) {
        int[] array = {1, -2, 3, 4, -5, 4 , 3, 2, 2, 2};

        //..

        //..
    }

    /**
     * param array исходный массив,
     * return возвращается новый массив класса DynaArray с положительными числами
     */
    //.. getPositiveNumbers(array) {
    // if число положительное, то применяется функция add туда передается объект класса DynaArray и полож число


    /**
     * функция, которая динамически расширяет наш динамический массив
     * param объект класса DynaArray
     * param полож число
     */
    //..add() {
    // сравнение количество заполненных элементов и реального размера массива
    // создание временного нового массива с элементами x2
    // слияние двух массивов через for добавляя элементы или arraycopy
}
