package home_section001_classes.dyna_array;

/**
 * **
 * Все классы в этом задании создаются в пакете dyna_array
 *
 * Создать класс HomeDynaArrayVer4 там создать пустой массив int[] размерностью 5 и объявить int переменную
 * В классе HomeDynaArrayVer4 написать метод add, которая динамически расширяет наш динамический массив при увеличение элементов
 * (Не забудь в методе add можно указывать без объекта поля, потомучто метод уже в классе)
 * В классе HomeDynaArrayVer4 написать метод toArray(), который будет возвращать статический массив целого типа в количестве count
 * Создать класс HomeDynaArrayTestVer4 в нем создать 2 объекта класса HomeDynaArrayVer4  dynaArraytest1, dynaArraytest2 класса HomeDynaArrayVer4
 * В первый объект ничего не добавлять, во второй через метод add добавить 5 разных чисел.
 * Отобразить первый и второй массивы объектов System.out.print("dynaArray1: "); System.out.print("dynaArray2: ");
 *
 * Удалить решение
 */
public class HomeSolutionVer4 {
}
