package home_section001_classes.pack_package;

/**
 * Создать класс PackageTest в пакете pack
 * В классе PackageTest:
 * Прописать путь до класса HomeDynaArrayVer2, создать объект этого класса..
 * Прописать полный/абсолютный путь до класса DynaArray, создать объект этого класса.
 * Прописать полный/абсолютный путь до класса Class1 в пакете package1, создать объект этого класса.
 * Прописать полный/абсолютный путь до класса Class2 в пакете package2, создать объект этого класса.
 * !Создать любой класс в пакете по умолчанию и прописать до него путь в классе PackageTest, создать объект этого класса.
 * пакет по умолчанию -> src
 * Все те же задания только использовать не полный/абсолютный путь, а import, создать объекты этих классов.
 * Если импорт не понятен, тема #121 import
 *
 * Бонус: Оптимизировать импорт классов Arrays, BitSet, тема #123
 */

public class HomeSolutionVer6 {
}
